react-backend/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    # @post.user_id = @current_user.id

    if @post.save
---
INSERT INTO "posts" ("title", "text", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First Submit"], ["text", "LETS GET THIS WORKING"], ["date", "2021-07-14"], ["created_at", "2021-07-20 06:23:48.990600"], ["updated_at", "2021-07-20 06:23:48.990600"]]