react-backend/app/controllers/sessions_controller.rb

    def create
        user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "vic"], ["LIMIT", 1]]