react-backend/app/controllers/tags_controller.rb

    def index
    #   name = params[:name]
      @tags = ActsAsTaggableOn::Tag.all
---
SELECT "tags".* FROM "tags"