react-backend/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Victoria Thorsen"], ["username", "vic"], ["email", "victoriathorsenn@gmail.com"], ["created_at", "2021-07-23 08:30:36.718754"], ["updated_at", "2021-07-23 08:30:36.718754"]]